Revit 2027 API
ViewSchedule.RefreshData Method
 Rebuilds the schedule data if it is out of date.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RefreshData()
Public Function RefreshData As Boolean
public:
bool RefreshData()
member RefreshData : unit -> bool
Return Value
Boolean
 True if the data is up to date after the refresh.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace